:PROPERTIES:
:ID:       cc00c876-c5f4-4c18-8ea4-016e3da9d879
:END:
#+title: linux-tool-top
#+date: [2024-07-05 五]
#+last_modified: [2024-07-05 五 18:15]

* Show All Proc family with argv 
#+BEGIN_SRC sh :results verbatim :noweb yes
   pstree \
	 -a  <<->> Show Complete Comand(path + argv) 
#+END_SRC

#+RESULTS:
#+begin_example
systemd splash
  |-ModemManager
  |   `-2*[{ModemManager}]
  |-NetworkManager --no-daemon
  |   `-2*[{NetworkManager}]
  |-accounts-daemon
  |   `-2*[{accounts-daemon}]
  |-acpid
  |-avahi-daemon
  |   `-avahi-daemon
  |-beam.smp -B -- -root /snap/rabbitmq-server-snap/51/usr/lib/erlang-prog
  |   |-erl_child_setup 1024
  |   `-47*[{beam.smp}]
  |-beam.smp -SDio 16 -Bd -- -root /opt/couchdb/bin/.. -progname couchdb -- -home /opt/couchdb--
  |   |-erl_child_setup 65536
  |   `-53*[{beam.smp}]
  |-bluetoothd
  |-colord
  |   `-2*[{colord}]
  |-containerd
  |   `-17*[{containerd}]
  |-cron -f -P
  |-cups-browsed
  |   `-2*[{cups-browsed}]
  |-cupsd -l
  |-dbus-daemon --system --address=systemd: --nofork --nopidfile --systemd-activation --syslog-only
  |-dnsmasq --conf-file=/var/lib/libvirt/dnsmasq/default.conf --leasefile-ro--dhcp-script=/usr/lib/libvirt/libvirt_leaseshelp
  |   `-dnsmasq --conf-file=/var/lib/libvirt/dnsmasq/default.conf --leasefile-ro--dhcp-script=/usr/lib/libvirt/libvirt_leaseshelp
  |-dockerd -H fd:// --containerd=/run/containerd/containerd.sock
  |   `-18*[{dockerd}]
  |-epmd -daemon
  |-gdm3
  |   |-gdm-session-wor
  |   |   |-gdm-wayland-ses env GNOME_SHELL_SESSION_MODE=ubuntu /usr/bin/gnome-session --session=ubuntu
  |   |   |   |-gnome-session-b --session=ubuntu
  |   |   |   |   `-2*[{gnome-session-b}]
  |   |   |   `-2*[{gdm-wayland-ses}]
  |   |   `-2*[{gdm-session-wor}]
  |   `-2*[{gdm3}]
  |-gnome-keyring-d --daemonize --login
  |   |-ssh-agent -D -a /run/user/1000/keyring/.ssh
  |   `-3*[{gnome-keyring-d}]
  |-irqbalance --foreground
  |   `-{irqbalance}
  |-kerneloops --test
  |-kerneloops
  |-libvirtd
  |   `-18*[{libvirtd}]
  |-mongod --dbpath=/var/snap/mongo33/2/../common --port=33017 --smallfiles --noprealloc
  |   `-16*[{mongod}]
  |-mount.ntfs /dev/sda1 /media/lyt0628/NORMAL -o rw,nodev,nosuid,uid=1000,gid=1000,windows_names,uhelper=udisks2
  |-node --no-warnings /snap/kibana/1/bin/../src/cli
  |   `-9*[{node}]
  |-packagekitd
  |   `-2*[{packagekitd}]
  |-polkitd --no-debug
  |   `-2*[{polkitd}]
  |-postgres -D /var/lib/postgresql/14/main -c config_file=/etc/postgresql/14/main/postgresql.conf
  |   |-postgres
  |   |-postgres
  |   |-postgres
  |   |-postgres
  |   |-postgres
  |   `-postgres
  |-power-profiles-
  |   `-2*[{power-profiles-}]
  |-python3 /usr/lib/software-properties/software-properties-dbus
  |-rpc.statd
  |-rpcbind -f -w
  |-rsyslogd -n -iNONE
  |   `-3*[{rsyslogd}]
  |-rtkit-daemon
  |   `-2*[{rtkit-daemon}]
  |-run-cups-browse /snap/cups/1058/scripts/run-cups-browsed
  |   `-run-cups-browse /snap/cups/1058/scripts/run-cups-browsed
  |       `-sleep 3600
  |-run-cupsd /snap/cups/1058/scripts/run-cupsd
  |   `-cupsd -f -s /var/snap/cups/common/etc/cups/cups-files.conf -c /var/snap/cups/common/etc/cups/cupsd.conf
  |-snapd
  |   `-22*[{snapd}]
  |-sshd
  |-switcheroo-cont
  |   `-2*[{switcheroo-cont}]
  |-systemd --user
  |   |-(sd-pam)
  |   |-at-spi2-registr --use-gnome-session
  |   |   `-2*[{at-spi2-registr}]
  |   |-chrome
  |   |   |-cat
  |   |   |-cat
  |   |   |-chrome
  |   |   |   `-chrome
  |   |   |       `-25*[{chrome}]
  |   |   |-chrome
  |   |   |   `-chrome
  |   |   |       |-chrome
  |   |   |       |   `-9*[{chrome}]
  |   |   |       |-chrome
  |   |   |       |   `-6*[{chrome}]
  |   |   |       |-chrome
  |   |   |       |   `-22*[{chrome}]
  |   |   |       |-chrome
  |   |   |       |   `-6*[{chrome}]
  |   |   |       |-chrome
  |   |   |       |   `-22*[{chrome}]
  |   |   |       |-chrome
  |   |   |       |   `-18*[{chrome}]
  |   |   |       `-chrome
  |   |   |           `-22*[{chrome}]
  |   |   |-chrome
  |   |   |   `-11*[{chrome}]
  |   |   `-33*[{chrome}]
  |   |-chrome_crashpad --monitor-self --monitor-self-annotation=ptype=crashpad-handler--database=/home/lyt0628/
  |   |   `-2*[{chrome_crashpad}]
  |   |-chrome_crashpad --no-periodic-tasks --monitor-self-annotation=ptype=crashpad-handler--database=/home/lyt
  |   |   `-{chrome_crashpad}
  |   |-dbus-daemon --session --address=systemd: --nofork --nopidfile --systemd-activation --syslog-only
  |   |-dbus-daemon --syslog --fork --print-pid 4 --print-address 6 --config-file/usr/share/fcitx/dbus/daemon.c
  |   |-dconf-service
  |   |   `-2*[{dconf-service}]
  |   |-emacs --daemon
  |   |   `-{emacs}
  |   |-evolution-addre
  |   |   `-5*[{evolution-addre}]
  |   |-evolution-calen
  |   |   `-8*[{evolution-calen}]
  |   |-evolution-sourc
  |   |   `-3*[{evolution-sourc}]
  |   |-fcitx
  |   |   `-2*[{fcitx}]
  |   |-fcitx-dbus-watc unix:abstract=/tmp/dbus-IEYxiUaYDC,guid=fe33ba7e48f89ff7469a3c9966834423 2519
  |   |-gjs /usr/share/gnome-shell/org.gnome.Shell.Notifications
  |   |   `-10*[{gjs}]
  |   |-gjs /usr/share/gnome-shell/org.gnome.ScreenSaver
  |   |   `-10*[{gjs}]
  |   |-gnome-calendar --gapplication-service
  |   |   `-5*[{gnome-calendar}]
  |   |-gnome-session-b --systemd-service --session=ubuntu
  |   |   |-at-spi-bus-laun --launch-immediately
  |   |   |   |-dbus-daemon --config-file=/usr/share/defaults/at-spi2/accessibility.conf --nofork --print-address 11...
  |   |   |   `-3*[{at-spi-bus-laun}]
  |   |   |-evolution-alarm
  |   |   |   `-5*[{evolution-alarm}]
  |   |   |-gsd-disk-utilit
  |   |   |   `-2*[{gsd-disk-utilit}]
  |   |   |-update-notifier
  |   |   |   `-3*[{update-notifier}]
  |   |   `-3*[{gnome-session-b}]
  |   |-gnome-session-c --monitor
  |   |   `-{gnome-session-c}
  |   |-gnome-shell
  |   |   |-ReapPoolWorkers /usr/bin/calibre
  |   |   |   |-calibre-paralle /usr/bin/calibre-parallel --pipe-worker...
  |   |   |   `-26*[{ReapPoolWorkers}]
  |   |   |-Xwayland :0 -rootless -noreset -accessx -core -auth /run/user/1000/.mutter-Xwaylandauth.9KTDQ2 -listen 4 -listen 5...
  |   |   |   `-14*[{Xwayland}]
  |   |   |-baidunetdisk
  |   |   |   |-baidunetdisk
  |   |   |   |   `-baidunetdisk
  |   |   |   |       `-9*[{baidunetdisk}]
  |   |   |   |-baidunetdisk
  |   |   |   |-baidunetdisk
  |   |   |   |   `-4*[{baidunetdisk}]
  |   |   |   |-baidunetdisk
  |   |   |   |   `-20*[{baidunetdisk}]
  |   |   |   |-baidunetdisk
  |   |   |   |   `-12*[{baidunetdisk}]
  |   |   |   |-baidunetdisk
  |   |   |   |   `-12*[{baidunetdisk}]
  |   |   |   |-baidunetdisk
  |   |   |   |   `-5*[{baidunetdisk}]
  |   |   |   `-51*[{baidunetdisk}]
  |   |   |-emacs-gtk
  |   |   |   |-TabNine --client emacs
  |   |   |   |   |-TabNine --client emacs --no_bootstrap
  |   |   |   |   |   |-TabNine-deep-lo --settings/home/lyt0628/.config/TabNine/local.settingsce
  |   |   |   |   |   |   `-69*[{TabNine-deep-lo}]
  |   |   |   |   |   `-100*[{TabNine}]
  |   |   |   |   |-WD-TabNine --client emacs
  |   |   |   |   |   `-24*[{WD-TabNine}]
  |   |   |   |   `-45*[{TabNine}]
  |   |   |   |-sh -c sh
  |   |   |   |   `-sh
  |   |   |   |       `-pstree -a
  |   |   |   `-4*[{emacs-gtk}]
  |   |   |-gjs /usr/share/gnome-shell/extensions/ding@rastersoft.com/ding.js -E -P ...
  |   |   |   `-11*[{gjs}]
  |   |   `-29*[{gnome-shell}]
  |   |-gnome-shell-cal
  |   |   `-5*[{gnome-shell-cal}]
  |   |-gnome-terminal /usr/bin/gnome-terminal --wait
  |   |   `-gnome-terminal. --wait
  |   |       `-3*[{gnome-terminal.}]
  |   |-gnome-terminal-
  |   |   |-bash
  |   |   |   `-top
  |   |   `-3*[{gnome-terminal-}]
  |   |-goa-daemon
  |   |   `-3*[{goa-daemon}]
  |   |-goa-identity-se
  |   |   `-2*[{goa-identity-se}]
  |   |-gsd-a11y-settin
  |   |   `-3*[{gsd-a11y-settin}]
  |   |-gsd-color
  |   |   `-3*[{gsd-color}]
  |   |-gsd-datetime
  |   |   `-3*[{gsd-datetime}]
  |   |-gsd-housekeepin
  |   |   `-3*[{gsd-housekeepin}]
  |   |-gsd-keyboard
  |   |   `-3*[{gsd-keyboard}]
  |   |-gsd-media-keys
  |   |   `-3*[{gsd-media-keys}]
  |   |-gsd-power
  |   |   `-4*[{gsd-power}]
  |   |-gsd-print-notif
  |   |   `-2*[{gsd-print-notif}]
  |   |-gsd-printer
  |   |   `-2*[{gsd-printer}]
  |   |-gsd-rfkill
  |   |   `-2*[{gsd-rfkill}]
  |   |-gsd-screensaver
  |   |   `-2*[{gsd-screensaver}]
  |   |-gsd-sharing
  |   |   `-3*[{gsd-sharing}]
  |   |-gsd-smartcard
  |   |   `-3*[{gsd-smartcard}]
  |   |-gsd-sound
  |   |   `-3*[{gsd-sound}]
  |   |-gsd-wacom
  |   |   `-3*[{gsd-wacom}]
  |   |-gsd-xsettings
  |   |   `-16*[{gsd-xsettings}]
  |   |-gvfs-afc-volume
  |   |   `-3*[{gvfs-afc-volume}]
  |   |-gvfs-goa-volume
  |   |   `-2*[{gvfs-goa-volume}]
  |   |-gvfs-gphoto2-vo
  |   |   `-2*[{gvfs-gphoto2-vo}]
  |   |-gvfs-mtp-volume
  |   |   `-2*[{gvfs-mtp-volume}]
  |   |-gvfs-udisks2-vo
  |   |   `-3*[{gvfs-udisks2-vo}]
  |   |-gvfsd
  |   |   |-gvfsd-dnssd --spawner :1.6 /org/gtk/gvfs/exec_spaw/3
  |   |   |   `-2*[{gvfsd-dnssd}]
  |   |   |-gvfsd-http --spawner :1.6 /org/gtk/gvfs/exec_spaw/4
  |   |   |   `-2*[{gvfsd-http}]
  |   |   |-gvfsd-network --spawner :1.6 /org/gtk/gvfs/exec_spaw/1
  |   |   |   `-3*[{gvfsd-network}]
  |   |   |-gvfsd-trash --spawner :1.6 /org/gtk/gvfs/exec_spaw/0
  |   |   |   `-2*[{gvfsd-trash}]
  |   |   `-2*[{gvfsd}]
  |   |-gvfsd-fuse /run/user/1000/gvfs -f
  |   |   `-5*[{gvfsd-fuse}]
  |   |-gvfsd-metadata
  |   |   `-2*[{gvfsd-metadata}]
  |   |-ibus-portal
  |   |   `-2*[{ibus-portal}]
  |   |-ibus-x11
  |   |   `-2*[{ibus-x11}]
  |   |-nautilus --gapplication-service
  |   |   `-4*[{nautilus}]
  |   |-pipewire
  |   |   `-{pipewire}
  |   |-pipewire-media-
  |   |   `-{pipewire-media-}
  |   |-pulseaudio --daemonize=no --log-target=journal
  |   |   `-3*[{pulseaudio}]
  |   |-seahorse --gapplication-service
  |   |   `-3*[{seahorse}]
  |   |-sh -c /usr/bin/ibus-daemon --panel disable $([ "$XDG_SESSION_TYPE" = "x11" ] && echo "--xim")
  |   |   `-ibus-daemon --panel disable
  |   |       |-ibus-engine-lib --ibus
  |   |       |   `-3*[{ibus-engine-lib}]
  |   |       |-ibus-engine-moz --ibus
  |   |       |   |-mozc_server
  |   |       |   |   `-2*[{mozc_server}]
  |   |       |   `-3*[{ibus-engine-moz}]
  |   |       |-ibus-engine-sim
  |   |       |   `-2*[{ibus-engine-sim}]
  |   |       |-ibus-extension-
  |   |       |   `-3*[{ibus-extension-}]
  |   |       |-ibus-memconf
  |   |       |   `-2*[{ibus-memconf}]
  |   |       `-2*[{ibus-daemon}]
  |   |-snap userd
  |   |   `-20*[{snap}]
  |   |-snap-store --gapplication-service
  |   |   `-4*[{snap-store}]
  |   |-snapd-desktop-i
  |   |   `-snapd-desktop-i
  |   |       `-4*[{snapd-desktop-i}]
  |   |-sogoupinyin-ser
  |   |   `-10*[{sogoupinyin-ser}]
  |   |-sogoupinyin-wat
  |   |   `-5*[{sogoupinyin-wat}]
  |   |-tmux: server
  |   |   |-bash
  |   |   |-bash
  |   |   |-bash
  |   |   |-bash
  |   |   |-bash
  |   |   |   `-fish
  |   |   |-bash
  |   |   |   `-fish
  |   |   |       `-ruby
  |   |   |           `-28*[{ruby}]
  |   |   `-bash
  |   |       `-fish
  |   |           `-vim record.sh
  |   |-tracker-miner-f
  |   |   `-5*[{tracker-miner-f}]
  |   |-xdg-desktop-por
  |   |   `-5*[{xdg-desktop-por}]
  |   |-xdg-desktop-por
  |   |   `-17*[{xdg-desktop-por}]
  |   |-xdg-desktop-por
  |   |   `-3*[{xdg-desktop-por}]
  |   |-xdg-document-po
  |   |   |-fusermount3 -o rw,nosuid,nodev,fsname=portal,auto_unmount,subtype=portal -- /run/user/1000/doc
  |   |   `-5*[{xdg-document-po}]
  |   `-xdg-permission-
  |       `-2*[{xdg-permission-}]
  |-systemd-journal
  |-systemd-logind
  |-systemd-machine
  |-systemd-oomd
  |-systemd-resolve
  |-systemd-timesyn
  |   `-{systemd-timesyn}
  |-systemd-udevd
  |-thermald --systemd --dbus-enable --adaptive
  |   `-3*[{thermald}]
  |-ubuntu-advantag
  |   `-2*[{ubuntu-advantag}]
  |-udisksd
  |   `-4*[{udisksd}]
  |-unattended-upgr /usr/share/unattended-upgrades/unattended-upgrade-shutdown --wait-for-signal
  |   `-{unattended-upgr}
  |-upowerd
  |   `-2*[{upowerd}]
  `-wpa_supplicant -u -s -O /run/wpa_supplicant
#+end_example


